In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('data_m1.csv')
data

      Name  Marks         Grades
0  Priyang   98.0  not available
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0             BB

## Convert all missing values as NaN 
- pd.read_csv('xxx.csv', na_values={'Grades':['not avaliable', 'wrong value']})

In [3]:
data

      Name  Marks         Grades
0  Priyang   98.0  not available
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0             BB

In [4]:
data=pd.read_csv('data_m1.csv', na_values={'Grades':'not available'})
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB